**Testing logs :**


**1st: Without Terraform fix in.**
====================
rahul.gahlautibm.com@Rahuls-MacBook-Pro temp % terraform plan
╷
│ Error: "cipher.0" must contain a value from []string{"ECDHE-ECDSA-AES128-GCM-SHA256", "ECDHE-ECDSA-CHACHA20-POLY1305", "ECDHE-RSA-AES128-GCM-SHA256", "ECDHE-RSA-CHACHA20-POLY1305", "ECDHE-ECDSA-AES128-SHA256", "ECDHE-ECDSA-AES128-SHA", "ECDHE-RSA-AES128-SHA256", "ECDHE-RSA-AES128-SHA", "AES128-GCM-SHA256", "AES128-SHA256", "AES128-SHA", "ECDHE-ECDSA-AES256-GCM-SHA384", "ECDHE-ECDSA-AES256-SHA384", "ECDHE-RSA-AES256-GCM-SHA384", "ECDHE-RSA-AES256-SHA384", "ECDHE-RSA-AES256-SHA", "AES256-GCM-SHA384", "AES256-SHA256", "AES256-SHA", "DES-CBC3-SHA"}, got "AEAD-AES128-GCM-SHA256"
│ 
│   with ibm_cis_domain_settings.test,
│   on main.tf line 41, in resource "ibm_cis_domain_settings" "test":
│   41:   cipher                      = ["AEAD-AES128-GCM-SHA256"]
│ 
╵
rahul.gahlautibm.com@Rahuls-MacBook-Pro temp % 



**With Terraform fix in** 
=================
**NOTE : still API fix is not deployed hence we are getting error But we are fixing it in terraform side. Once API fix is deployed we’ll verify it again.**

  # ibm_cis_domain_settings.test will be created
  + resource "ibm_cis_domain_settings" "test" {
      + always_use_https            = "off"
      + automatic_https_rewrites    = "on"
      + brotli                      = "off"
      + browser_check               = "off"
      + certificate_status          = (known after apply)
      + challenge_ttl               = 31536000
      + cipher                      = [
          + "AEAD-AES128-GCM-SHA256",
        ]
      + cis_id                      = "crn:v1:staging:public:internet-svcs-ci:global:a/01652b251c3ae2787110a995d8db0135:cc0a9aff-ae5f-40d7-b11d-c9a2d2c276a2::"
      + cname_flattening            = "flatten_all"
      + dnssec                      = "active"
      + domain_id                   = "feabea42a71e6fd976016b2efa297205"
      + hotlink_protection          = "off"
      + http2                       = "on"
      + id                          = (known after apply)
      + image_load_optimization     = "off"
      + image_size_optimization     = "lossless"
      + ip_geolocation              = "off"
      + ipv6                        = "off"
      + max_upload                  = 300
      + min_tls_version             = "1.3"
      + opportunistic_encryption    = "off"
      + origin_error_page_pass_thru = "off"
      + prefetch_preload            = "off"
      + pseudo_ipv4                 = "off"
      + response_buffering          = "off"
      + script_load_optimization    = "off"
      + server_side_exclude         = "off"
      + ssl                         = "flexible"
      + tls_client_auth             = "off"
      + true_client_ip_header       = "off"
      + waf                         = "off"
      + websockets                  = "off"

      + minify {
          + css  = (known after apply)
          + html = (known after apply)
          + js   = (known after apply)
        }

      + mobile_redirect {
          + mobile_subdomain = (known after apply)
          + status           = (known after apply)
          + strip_uri        = (known after apply)
        }

      + security_header {
          + enabled            = (known after apply)
          + include_subdomains = (known after apply)
          + max_age            = (known after apply)
          + nosniff            = (known after apply)
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

ibm_cis_domain_settings.test: Creating...
ibm_cis_domain_settings.test: Still creating... [10s elapsed]
ibm_cis_domain_settings.test: Still creating... [20s elapsed]
╷
│ Error: Cipher suite selections are not supported for a minimum TLS version of 1.3 and vice versa. Please check your input and try again.
